public class MethodTest {


	//여기에 메소드 작성

	public static void main(String[] args) {//()가 있으면 파라미터가 있는 메소드
		// TODO Auto-generated method stub
		//메소드 내부에 메소드 X

	}// main method

	//여기에 메소드 작성

}

//Method란
//하나 또는 여러가지 기능을 묶어서 독립적으로 사용할 수 있는 프로그램 구성 단위.(모듈이라고도 합니다.)
//입력값(파라미터)을 넣어주면 해당 기능을 처리하고 출력값을 되돌려 준다(반환한다.)
//CPU 
//
//메소드 종류
//1. 파라미터와 반환값이 두가지 전부 다 존재하는 메소드
//2. 파라미터는 존재하나 반환값이 없는 메소드
//3. 파라미터는 없으나 반환값은 존재하는 메소드
//4. 둘 다 없는 메소드
//
//메소드 작성 형식
//자료형 메소드이름(매개 변수1, 매개 변수2, ...){ ... }
//
//
//특수문자는 _, $만 사용 가능, 2개 이상 단어 조합시 첫번째 글자는 대문자
//클래스이름 - 첫글자 대문자, 상수 - 모든 글자 대문자
//
//메소드는 이름을 마음대로 작성할 수 있음.
//하지만 main 메소드는 마음대로 이름을 작성할 수 없음. 
//main 메소드는 무조건 한 프로그램에 반드시 한개만 있어야함.
//똑같은 이름 사용하면 안됨



